node {
  name: "debiased_classifier/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 18
        }
      }
    }
  }
}
node {
  name: "debiased_classifier/Placeholder_1"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "debiased_classifier/Placeholder_2"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "debiased_classifier/Placeholder_3"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\022\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal/mul"
  op: "Mul"
  input: "debiased_classifier/classifier_model/random_normal/RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal"
  op: "Add"
  input: "debiased_classifier/classifier_model/random_normal/mul"
  input: "debiased_classifier/classifier_model/random_normal/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Square"
  op: "Square"
  input: "debiased_classifier/classifier_model/random_normal"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum"
  op: "Sum"
  input: "debiased_classifier/classifier_model/Square"
  input: "debiased_classifier/classifier_model/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0000000116860974e-07
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/add/x"
  input: "debiased_classifier/classifier_model/Sum"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sqrt"
  op: "Sqrt"
  input: "debiased_classifier/classifier_model/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/truediv"
  op: "RealDiv"
  input: "debiased_classifier/classifier_model/random_normal"
  input: "debiased_classifier/classifier_model/Sqrt"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 18
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear/kernel/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear/kernel"
  input: "debiased_classifier/classifier_model/truediv"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear/kernel/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear/kernel"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear/bias/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear/bias/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear/bias"
  input: "debiased_classifier/classifier_model/linear/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear/bias/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear/bias"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_1/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "@\000\000\000 \000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_1/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_1/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_1/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_1/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_1/mul"
  op: "Mul"
  input: "debiased_classifier/classifier_model/random_normal_1/RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_1/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_1"
  op: "Add"
  input: "debiased_classifier/classifier_model/random_normal_1/mul"
  input: "debiased_classifier/classifier_model/random_normal_1/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Square_1"
  op: "Square"
  input: "debiased_classifier/classifier_model/random_normal_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_1/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_1"
  op: "Sum"
  input: "debiased_classifier/classifier_model/Square_1"
  input: "debiased_classifier/classifier_model/Sum_1/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_1/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0000000116860974e-07
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_1"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/add_1/x"
  input: "debiased_classifier/classifier_model/Sum_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sqrt_1"
  op: "Sqrt"
  input: "debiased_classifier/classifier_model/add_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/truediv_1"
  op: "RealDiv"
  input: "debiased_classifier/classifier_model/random_normal_1"
  input: "debiased_classifier/classifier_model/Sqrt_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_1/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_1/kernel/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_1/kernel"
  input: "debiased_classifier/classifier_model/truediv_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_1/kernel/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_1/kernel"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_1/bias/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 32
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_1/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_1/bias/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_1/bias"
  input: "debiased_classifier/classifier_model/linear_1/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_1/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_1/bias/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_1/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_1/bias"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_2/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: " \000\000\000\020\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_2/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_2/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_2/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_2/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_2/mul"
  op: "Mul"
  input: "debiased_classifier/classifier_model/random_normal_2/RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_2/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_2"
  op: "Add"
  input: "debiased_classifier/classifier_model/random_normal_2/mul"
  input: "debiased_classifier/classifier_model/random_normal_2/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Square_2"
  op: "Square"
  input: "debiased_classifier/classifier_model/random_normal_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_2/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_2"
  op: "Sum"
  input: "debiased_classifier/classifier_model/Square_2"
  input: "debiased_classifier/classifier_model/Sum_2/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_2/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0000000116860974e-07
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_2"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/add_2/x"
  input: "debiased_classifier/classifier_model/Sum_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sqrt_2"
  op: "Sqrt"
  input: "debiased_classifier/classifier_model/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/truediv_2"
  op: "RealDiv"
  input: "debiased_classifier/classifier_model/random_normal_2"
  input: "debiased_classifier/classifier_model/Sqrt_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_2/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 32
        }
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_2/kernel/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_2/kernel"
  input: "debiased_classifier/classifier_model/truediv_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_2/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_2/kernel/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_2/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_2/kernel"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_2/bias/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 16
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_2/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_2/bias/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_2/bias"
  input: "debiased_classifier/classifier_model/linear_2/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_2/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_2/bias/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_2/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_2/bias"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_3/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\020\000\000\000\010\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_3/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_3/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_3/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_3/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_3/mul"
  op: "Mul"
  input: "debiased_classifier/classifier_model/random_normal_3/RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_3/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_3"
  op: "Add"
  input: "debiased_classifier/classifier_model/random_normal_3/mul"
  input: "debiased_classifier/classifier_model/random_normal_3/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Square_3"
  op: "Square"
  input: "debiased_classifier/classifier_model/random_normal_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_3/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_3"
  op: "Sum"
  input: "debiased_classifier/classifier_model/Square_3"
  input: "debiased_classifier/classifier_model/Sum_3/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0000000116860974e-07
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_3"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/add_3/x"
  input: "debiased_classifier/classifier_model/Sum_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sqrt_3"
  op: "Sqrt"
  input: "debiased_classifier/classifier_model/add_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/truediv_3"
  op: "RealDiv"
  input: "debiased_classifier/classifier_model/random_normal_3"
  input: "debiased_classifier/classifier_model/Sqrt_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_3/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 16
        }
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_3/kernel/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_3/kernel"
  input: "debiased_classifier/classifier_model/truediv_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_3/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_3/kernel/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_3/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_3/kernel"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_3/bias/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 8
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_3/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_3/bias/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_3/bias"
  input: "debiased_classifier/classifier_model/linear_3/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_3/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_3/bias/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_3/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_3/bias"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_4/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\010\000\000\000\004\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_4/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_4/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_4/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_4/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_4/mul"
  op: "Mul"
  input: "debiased_classifier/classifier_model/random_normal_4/RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_4/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_4"
  op: "Add"
  input: "debiased_classifier/classifier_model/random_normal_4/mul"
  input: "debiased_classifier/classifier_model/random_normal_4/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Square_4"
  op: "Square"
  input: "debiased_classifier/classifier_model/random_normal_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_4/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_4"
  op: "Sum"
  input: "debiased_classifier/classifier_model/Square_4"
  input: "debiased_classifier/classifier_model/Sum_4/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0000000116860974e-07
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_4"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/add_4/x"
  input: "debiased_classifier/classifier_model/Sum_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sqrt_4"
  op: "Sqrt"
  input: "debiased_classifier/classifier_model/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/truediv_4"
  op: "RealDiv"
  input: "debiased_classifier/classifier_model/random_normal_4"
  input: "debiased_classifier/classifier_model/Sqrt_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_4/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 8
        }
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_4/kernel/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_4/kernel"
  input: "debiased_classifier/classifier_model/truediv_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_4/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_4/kernel/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_4/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_4/kernel"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_4/bias/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_4/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_4/bias/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_4/bias"
  input: "debiased_classifier/classifier_model/linear_4/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_4/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_4/bias/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_4/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_4/bias"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_5/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\004\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_5/mean"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_5/stddev"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_5/RandomStandardNormal"
  op: "RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_5/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_5/mul"
  op: "Mul"
  input: "debiased_classifier/classifier_model/random_normal_5/RandomStandardNormal"
  input: "debiased_classifier/classifier_model/random_normal_5/stddev"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/random_normal_5"
  op: "Add"
  input: "debiased_classifier/classifier_model/random_normal_5/mul"
  input: "debiased_classifier/classifier_model/random_normal_5/mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Square_5"
  op: "Square"
  input: "debiased_classifier/classifier_model/random_normal_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_5/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sum_5"
  op: "Sum"
  input: "debiased_classifier/classifier_model/Square_5"
  input: "debiased_classifier/classifier_model/Sum_5/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_5/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0000000116860974e-07
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_5"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/add_5/x"
  input: "debiased_classifier/classifier_model/Sum_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Sqrt_5"
  op: "Sqrt"
  input: "debiased_classifier/classifier_model/add_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/truediv_5"
  op: "RealDiv"
  input: "debiased_classifier/classifier_model/random_normal_5"
  input: "debiased_classifier/classifier_model/Sqrt_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_5/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 4
        }
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_5/kernel/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_5/kernel"
  input: "debiased_classifier/classifier_model/truediv_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_5/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_5/kernel/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_5/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_5/kernel"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_5/bias/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 1
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_5/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_5/bias/Assign"
  op: "Assign"
  input: "debiased_classifier/classifier_model/linear_5/bias"
  input: "debiased_classifier/classifier_model/linear_5/bias/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_5/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/linear_5/bias/read"
  op: "Identity"
  input: "debiased_classifier/classifier_model/linear_5/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@debiased_classifier/classifier_model/linear_5/bias"
      }
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/MatMul"
  op: "MatMul"
  input: "debiased_classifier/Placeholder"
  input: "debiased_classifier/classifier_model/linear/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_6"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/MatMul"
  input: "debiased_classifier/classifier_model/linear/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Relu"
  op: "Relu"
  input: "debiased_classifier/classifier_model/add_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/MatMul_1"
  op: "MatMul"
  input: "debiased_classifier/classifier_model/Relu"
  input: "debiased_classifier/classifier_model/linear_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_7"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/MatMul_1"
  input: "debiased_classifier/classifier_model/linear_1/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Relu_1"
  op: "Relu"
  input: "debiased_classifier/classifier_model/add_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/MatMul_2"
  op: "MatMul"
  input: "debiased_classifier/classifier_model/Relu_1"
  input: "debiased_classifier/classifier_model/linear_2/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_8"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/MatMul_2"
  input: "debiased_classifier/classifier_model/linear_2/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Relu_2"
  op: "Relu"
  input: "debiased_classifier/classifier_model/add_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/MatMul_3"
  op: "MatMul"
  input: "debiased_classifier/classifier_model/Relu_2"
  input: "debiased_classifier/classifier_model/linear_3/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_9"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/MatMul_3"
  input: "debiased_classifier/classifier_model/linear_3/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Relu_3"
  op: "Relu"
  input: "debiased_classifier/classifier_model/add_9"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/MatMul_4"
  op: "MatMul"
  input: "debiased_classifier/classifier_model/Relu_3"
  input: "debiased_classifier/classifier_model/linear_4/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/add_10"
  op: "AddV2"
  input: "debiased_classifier/classifier_model/MatMul_4"
  input: "debiased_classifier/classifier_model/linear_4/bias/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/Relu_4"
  op: "Relu"
  input: "debiased_classifier/classifier_model/add_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "debiased_classifier/classifier_model/MatMul_5"
  op: "MatMul"
  input: "debiased_classifier/classifier_model/Relu_4"
